---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertexArray.Clear
source: html/ea169279-b477-8d27-593f-c7358e309d36.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```